tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "heroku/brew"
tap "homebrew/cask-fonts"

cask_args appdir: "/Applications"

brew "yadm"           # Yet Another Dotfile Manager
brew "mas"
brew "asdf"           # Manage multiple runtime versions with a single CLI tool
brew "neovim"         # hyperextensible Vim-based text editor
brew "fish"           # Finally, a command line shell for the 90s
brew "httpie"         # HTTPie—aitch-tee-tee-pie—is a command line HTTP client with an intuitive UI, JSON support, syntax highlighting, wget-like downloads, plugins, and more
brew "browsh"         # Browsh is a fully-modern text-based browser
brew "ncdu"           # Ncdu is a disk usage analyzer with an ncurses interface
brew "ripgrep"        # ripgrep recursively searches directories for a regex pattern
brew "ranger"         # A VIM-inspired filemanager for the console
brew "exa"            # A modern version of ‘ls’
brew "htop"           # htop - an interactive process viewer for Unix
brew "fzf"            # A command-line fuzzy finder
brew "git-lfs"        # An open source Git extension for versioning large files
brew "fd"             # A simple, fast and user-friendly alternative to 'find'
brew "hyperfine"      # A command-line benchmarking tool

cask "vlc"            # VLC is a free and open source cross-platform multimedia player and framework that plays most multimedia files as well as DVDs, Audio CDs, VCDs, and various streaming protocols
cask "bloomrpc"       # GUI Client for GRPC Services
cask "enpass"         # Enpass is a cross-platform password management app to securely store passwords and other credentials in a virtual vault locked with a master password
cask "figma"          # A better way to design
cask "fork"           # Fork - a fast and friendly git client for Mac and Windows
cask "google-chrome"  # Continue your browsing experience from desktop to phone on Chrome
cask "iterm2"         # iTerm2 is a replacement for Terminal and the successor to iTerm
cask "proxyman"       # Modern and Delightful HTTP Debugging Proxy
cask "postico"        # A Modern PostgreSQL Client for the Mac
cask "slack"          # Slack is where work flows
cask "spotify"        # Spotify is a digital music service that gives you access to millions of songs
cask "notion"         # Too many tools? Too much chaos? With Notion, all your work is in one place

mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
mas "1Password 7", id: 1333542190
